USE Pharmacy_Warehouse;
INSERT INTO Supplier (
    supplier_id, supplier_name, company_address,
    contact_last_name, contact_first_name, contact_middle_name,
    phone_number, inn, license_number
) VALUES
(1, 'ООО «ФармПоставка»', 'г. Москва, ул. Угрешская, 14 ст. 2', 'Табальчук', 'Виталий', 'Владимирович', '8 (495) 679-88-66', '7723378990', 'Л042-00110-77/00161646'),
(2, 'ООО «Главфарм»', 'г. Москва, ул. Татарская, 7 стр. 1', 'Ожерельева', 'Марина', 'Александровна', '8 (495) 276-05-40', '9705163561', 'Л042-01137-77/00152944'),
(3, 'ООО «Медея-Фарм»', 'г. Санкт-Петербург, ул. Репищева, 20', 'Косилко', 'Владислав', 'Николаевич', '8 (812) 384-49-72', '7841503904', 'Л042-00110-77/00164985'),
(4, 'ООО «Астра Фарма»', 'г. Москва, ул. Жебрунова, 6 стр. 1', 'Пащенко', 'Лариса', 'Александровна', '780-91-11', '7718753074', 'Л042-01137-77/01094246');

INSERT INTO Warehouse_employee (
    employee_id, last_name, first_name, middle_name,
    passport_data, position_id, phone_number, salary, warehouse_id
) VALUES
(1, 'Смирнов', 'Алексей', 'Игоревич', '4510123456', 1, '7-999-111-22-33', 45000.00, 1),
(2, 'Кузнецова', 'Елена', 'Олеговна', '4511654321', 1, '7-911-333-22-11', 55000.00, 2),
(3, 'Васильев', 'Петр', 'Николаевич', '4512789654', 1, '7-921-456-78-90', 80000.00, 3),
(4, 'Морозова', 'Ирина', 'Сергеевна', '4513321987', 1, '7-981-777-33-22', 75000.00, 4),
(5, 'Тихонов', 'Дмитрий', 'Алексеевич', '4514456321', 1, '7-952-123-45-67', 60000.00, 1),
(6, 'Федоров', 'Максим', 'Евгеньевич', '4515654987', 1, '7-903-111-22-33', 46000.00, 2),
(7, 'Соколова', 'Мария', 'Дмитриевна', '4516111222', 1, '7-905-999-88-77', 57000.00, 3),
(8, 'Григорьев', 'Олег', 'Валентинович', '4517333444', 1, '7-906-222-33-44', 79000.00, 4),
(9, 'Никитина', 'Светлана', 'Ильинична', '4518112233', 2, '7-967-444-55-66', 47000.00, 1),
(10, 'Орлов', 'Антон', 'Сергеевич', '4519998877', 2, '7-925-123-02-11', 53000.00, 2),
(11, 'Белова', 'Наталья', 'Евгеньевна', '4520111222', 2, '7-921-144-23-45', 46000.00, 3),
(12, 'Ермаков', 'Константин', 'Павлович', '4521333444', 2, '7-921-888-77-22', 47000.00, 4),
(13, 'Захарова', 'Марина', 'Игоревна', '4522222333', 3, '7-931-112-55-66', 56000.00, 1),
(14, 'Денисов', 'Андрей', 'Викторович', '4523444555', 3, '7-931-223-66-77', 54000.00, 2),
(15, 'Павлова', 'Ксения', 'Олеговна', '4524666777', 3, '7-931-334-77-88', 79000.00, 3),
(16, 'Игнатов', 'Роман', 'Алексеевич', '4525777888', 3, '7-911-445-88-99', 45500.00, 4),
(17, 'Сафонова', 'Татьяна', 'Валерьевна', '4526888999', 4, '7-911-556-99-09', 61000.00, 1),
(18, 'Литвинов', 'Николай', 'Семёнович', '4527999000', 4, '7-911-667-06-11', 72000.00, 2),
(19, 'Чернова', 'Вероника', 'Сергеевна', '4528123987', 4, '7-931-778-11-22', 47000.00, 3),
(20, 'Ковалёв', 'Владислав', 'Дмитриевич', '4529456789', 4, '7-931-889-22-33', 53000.00, 4);
